Функция Отправители(ТипКонтрагента) Экспорт 
	
	ФайлJSON = ПолучитьИмяВременногоФайла(); 
	
	Структура = Новый Структура;
	ВложенаяСтруктура = Новый Структура;
	ВложенаяСтруктура.Вставить("CounterpartyProperty", ТипКонтрагента);
	
	Структура.Вставить("apiKey", APIКлюч);
	Структура.Вставить("modelName", "Counterparty");
	Структура.Вставить("calledMethod", "getCounterparties");
	Структура.Вставить("methodProperties", ВложенаяСтруктура);
	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Истина;
	
	ЗаписьJSON.ОткрытьФайл(ФайлJSON);
	
	ЗаписатьJSON(ЗаписьJSON, Структура);
	
	ЗаписьJSON.Закрыть();
	
	Ответ = ОтправитьЗапрос(ФайлJSON);
	МассивОтправителей = Ответ.data;
	
	Если Ответ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат МассивОтправителей;
	
	
КонецФункции // Отправители()

Функция КонтактныеЛица(RefСсылка) Экспорт
	
	ФайлJSON = ПолучитьИмяВременногоФайла(); 
	
	Структура = Новый Структура;
	ВложенаяСтруктура = Новый Структура;
	ВложенаяСтруктура.Вставить("Ref", RefСсылка);
	
	Структура.Вставить("apiKey", APIКлюч);
	Структура.Вставить("modelName", "Counterparty");
	Структура.Вставить("calledMethod", "getCounterpartyContactPersons");
	Структура.Вставить("methodProperties", ВложенаяСтруктура);
	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Истина;
	
	ЗаписьJSON.ОткрытьФайл(ФайлJSON);
	
	ЗаписатьJSON(ЗаписьJSON, Структура);
	
	ЗаписьJSON.Закрыть();
	
	Ответ = ОтправитьЗапрос(ФайлJSON);
	МассивКонтактныхЛиц = Ответ.data;
	
	Если Ответ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат МассивКонтактныхЛиц;
	
	
КонецФункции // Отправители()


// Отправка/обработка запросов новой почты
Функция ОтправитьЗапрос(ФайлJSON)
	
	ФайлРезультата = ПолучитьИмяВременногоФайла();
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL();
	
	HTTPСоединение = Новый HTTPСоединение("api.novaposhta.ua/v2.0/json/",,,,,,SSL);
	
	Попытка
		HTTPСоединение.ОтправитьДляОбработки(ФайлJSON,,ФайлРезультата);
		Результат = ЧтениеОтвета(ФайлРезультата);
		Возврат(Результат);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось выполнить запрос к API Новой почты " + ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат(Неопределено);
	КонецПопытки;
	
КонецФункции

Функция ЧтениеОтвета(ФайлРезультата)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьФайл(ФайлРезультата);
	
	Соответствие = Новый Соответствие;
	
	Соответствие = ПрочитатьJSON(ЧтениеJSON);
	
	ЧтениеJSON.Закрыть();
	
	Возврат(Соответствие)
	
КонецФункции
